In [1]:
import pandas as pd
import numpy as np

import acquire

# Using the iris data

### 1. Use the function defined in acquire.py to load the iris data.

In [3]:
df = acquire.get_iris_data()

this file exists, reading csv

In [4]:
df.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   species_id      150 non-null    int64
 1   measurement_id  150 non-null    int64
 2   sepal_length    150 non-null    float64
 3   sepal_width     150 non-null    float64
 4   petal_length    150 non-null    float64
 5   petal_width     150 non-null    float64
 6   species_name    150 non-null    object
dtypes: float64(4), int64(2), object(1)
memory usage: 9.4+ KB

### 2. Clean up the column names - replace the period with an underscore and lowercase.

In [6]:
df.columns.str.replace('.', '_', regex=False).str.lower()

Index(['species_id', 'measurement_id', 'sepal_length', 'sepal_width',
       'petal_length', 'petal_width', 'species_name'],
      dtype='object')

In [7]:
df.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### 3. Drop the species_id and measurement_id columns.

In [8]:
df = df.drop(columns=['species_id', 'measurement_id'])

In [9]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

### 4. Rename the species_name column to just species.

In [10]:
df = df.rename(columns={"species_name":'species'})

In [11]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### 5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [12]:
def prep_iris(df):
    """
    this will accept the untransformed iris data
    and return the data with the transformations that were applied
    """
    df = df.drop(columns=['species_id','measurement_id'])
    df = df.rename(columns={"species_name":'species'})
    
    return df

In [13]:
fresh_iris = acquire.get_iris_data()
fresh_iris.head()

this file exists, reading csv

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [14]:
prep_iris(fresh_iris).head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# Using the Telco dataset

### 1. Use the function defined in acquire.py to load the Telco data.

In [17]:
 df = acquire.get_telco_data()

In [18]:
df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   internet_service_type_id  7043 non-null   int64
 2   contract_type_id          7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  contract_type             7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

### 2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [20]:
pd.crosstab(df.payment_type_id, df.payment_type)

payment_type,Bank transfer (automatic),Credit card (automatic),Electronic check,Mailed check
payment_type_id,,,,
1,0,0,2365,0
2,0,0,0,1612
3,1544,0,0,0
4,0,1522,0,0

In [21]:
pd.crosstab(df.internet_service_type_id, df.internet_service_type)

internet_service_type      DSL  Fiber optic  None
internet_service_type_id
1                         2421            0     0
2                            0         3096     0
3                            0            0  1526

In [22]:
pd.crosstab(df.contract_type_id, df.contract_type)

contract_type     Month-to-month  One year  Two year
contract_type_id
1                           3875         0         0
2                              0      1473         0
3                              0         0      1695

In [23]:
df.columns

Index(['payment_type_id', 'internet_service_type_id', 'contract_type_id',
       'customer_id', 'gender', 'senior_citizen', 'partner', 'dependents',
       'tenure', 'phone_service', 'multiple_lines', 'online_security',
       'online_backup', 'device_protection', 'tech_support', 'streaming_tv',
       'streaming_movies', 'paperless_billing', 'monthly_charges',
       'total_charges', 'churn', 'contract_type', 'internet_service_type',
       'payment_type'],
      dtype='object')

In [25]:
df = df.drop(columns = ['payment_type_id','internet_service_type_id','contract_type_id'])

### 3. Handle null values.

In [26]:
df.internet_service_type.value_counts()

internet_service_type
Fiber optic    3096
DSL            2421
None           1526
Name: count, dtype: int64

In [27]:
df.isnull().sum()

customer_id              0
gender                   0
senior_citizen           0
partner                  0
dependents               0
tenure                   0
phone_service            0
multiple_lines           0
online_security          0
online_backup            0
device_protection        0
tech_support             0
streaming_tv             0
streaming_movies         0
paperless_billing        0
monthly_charges          0
total_charges            0
churn                    0
contract_type            0
internet_service_type    0
payment_type             0
dtype: int64

In [28]:
df.total_charges.value_counts()

total_charges
           11
20.2       11
19.75       9
19.9        8
20.05       8
           ..
2387.75     1
6302.8      1
2058.5      1
829.55      1
3707.6      1
Name: count, Length: 6531, dtype: int64

In [29]:
df.total_charges = df.total_charges.str.replace(' ', '0.0')

In [30]:
df.total_charges.value_counts()

total_charges
0.0        11
20.2       11
19.75       9
19.9        8
20.05       8
           ..
2387.75     1
6302.8      1
2058.5      1
829.55      1
3707.6      1
Name: count, Length: 6531, dtype: int64

### 4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [31]:
def prep_telco(df):
    '''
    this will accept the raw telco data
    and return the data with the applied transformations
    '''
    df = df.drop(columns = ['payment_type_id','internet_service_type_id','contract_type_id'])
    df.total_charges = df.total_charges.str.replace(' ', '0.0')
    
    return df

In [33]:
fresh_telco = acquire.get_telco_data()
fresh_telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [34]:
prep_telco(fresh_telco).head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

# Split your data

In [35]:
from sklearn.model_selection import train_test_split

### 1. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

In [36]:
def splitting_data(df, col):
    '''
    this will split the data into train, test, and validate datasets
    '''

    #first split
    train, validate_test = train_test_split(df,
                     train_size=0.6,
                     random_state=123,
                     stratify=df[col]
                    )
    
    #second split
    validate, test = train_test_split(validate_test,
                                     train_size=0.5,
                                      random_state=123,
                                      stratify=validate_test[col]
                        
                                     )
    return train, validate, test

### 2. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

In [37]:
iris_df = acquire.get_iris_data()

this file exists, reading csv

In [38]:
iris_df.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [39]:
iris_df = prep_iris(iris_df)

In [43]:
splitting_data(iris_df, 'species')

(     sepal_length  sepal_width  petal_length  petal_width     species
 24            4.8          3.4           1.9          0.2      setosa
 147           6.5          3.0           5.2          2.0   virginica
 88            5.6          3.0           4.1          1.3  versicolor
 123           6.3          2.7           4.9          1.8   virginica
 31            5.4          3.4           1.5          0.4      setosa
 ..            ...          ...           ...          ...         ...
 52            6.9          3.1           4.9          1.5  versicolor
 41            4.5          2.3           1.3          0.3      setosa
 12            4.8          3.0           1.4          0.1      setosa
 20            5.4          3.4           1.7          0.2      setosa
 131           7.9          3.8           6.4          2.0   virginica

 [90 rows x 5 columns],
      sepal_length  sepal_width  petal_length  petal_width     species
 144           6.7          3.3           5.7          2.5   virginica
 125           7.2          3.2           6.0          1.8   virginica
 100           6.3          3.3           6.0          2.5   virginica
 43            5.0          3.5           1.6          0.6      setosa
 91            6.1          3.0           4.6          1.4  versicolor
 72            6.3          2.5           4.9          1.5  versicolor
 17            5.1          3.5           1.4          0.3      setosa
 61            5.9          3.0           4.2          1.5  versicolor
 63            6.1          2.9           4.7          1.4  versicolor
 116           6.5          3.0           5.5          1.8   virginica
 51            6.4          3.2           4.5          1.5  versicolor
 32            5.2          4.1           1.5          0.1      setosa
 14            5.8          4.0           1.2          0.2      setosa
 4             5.0          3.6           1.4          0.2      setosa
 38            4.4          3.0           1.3          0.2      setosa
 146           6.3          2.5           5.0          1.9   virginica
 37            4.9          3.6           1.4          0.1      setosa
 129           7.2          3.0           5.8          1.6   virginica
 19            5.1          3.8           1.5          0.3      setosa
 101           5.8          2.7           5.1          1.9   virginica
 56            6.3          3.3           4.7          1.6  versicolor
 16            5.4          3.9           1.3          0.4      setosa
 105           7.6          3.0           6.6          2.1   virginica
 70            5.9          3.2           4.8          1.8  versicolor
 138           6.0          3.0           4.8          1.8   virginica
 80            5.5          2.4           3.8          1.1  versicolor
 74            6.4          2.9           4.3          1.3  versicolor
 67            5.8          2.7           4.1          1.0  versicolor
 45            4.8          3.0           1.4          0.3      setosa
 117           7.7          3.8           6.7          2.2   virginica,
      sepal_length  sepal_width  petal_length  petal_width     species
 22            4.6          3.6           1.0          0.2      setosa
 25            5.0          3.0           1.6          0.2      setosa
 86            6.7          3.1           4.7          1.5  versicolor
 34            4.9          3.1           1.5          0.2      setosa
 76            6.8          2.8           4.8          1.4  versicolor
 135           7.7          3.0           6.1          2.3   virginica
 42            4.4          3.2           1.3          0.2      setosa
 2             4.7          3.2           1.3          0.2      setosa
 75            6.6          3.0           4.4          1.4  versicolor
 93            5.0          2.3           3.3          1.0  versicolor
 66            5.6          3.0           4.5          1.5  versicolor
 68            6.2          2.2           4.5          1.5  versicolor
 65            6.7          3.1           4.4          1.4  versicolor
 115           6.4          3.2           5.3          2.3   virginica
 57            4.9          2.4           3.3          1.0  versicolor
 142           5.8          2.7           5.1          1.9   virginica
 122           7.7          2.8           6.7          2.0   virginica
 9             4.9          3.1           1.5          0.1      setosa
 119           6.0          2.2           5.0          1.5   virginica
 127           6.1          3.0           4.9          1.8   virginica
 130           7.4          2.8           6.1          1.9   virginica
 36            5.5          3.5           1.3          0.2      setosa
 39            5.1          3.4           1.5          0.2      setosa
 28            5.2          3.4           1.4          0.2      setosa
 104           6.5          3.0           5.8          2.2   virginica
 64            5.6          2.9           3.6          1.3  versicolor
 110           6.5          3.2           5.1          2.0   virginica
 33            5.5          4.2           1.4          0.2      setosa
 143           6.8          3.2           5.9          2.3   virginica
 77            6.7          3.0           5.0          1.7  versicolor)

In [44]:
train_iris, validate_iris, test_iris = splitting_data(iris_df, 'species')

In [46]:
print(train_iris.shape)
print(validate_iris.shape)
print(test_iris.shape)

(90, 5)
(30, 5)
(30, 5)

### 3. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

In [48]:
titanic_df = acquire.get_titanic_data()

this file exists, reading csv

In [50]:
def clean_titanic(df):
    """
    this will bring back the titanic dataframe with the new transformations
    """
    #drop unncessary columns
    df = df.drop(columns=['embarked', 'age','deck', 'class'])
    
    #made this a string so its categorical
    df.pclass = df.pclass.astype(object)
    
    #filled nas with the mode
    df.embark_town = df.embark_town.fillna('Southampton')
    
    return df

In [51]:
fresh_df = acquire.get_titanic_data()

this file exists, reading csv

In [52]:
fresh_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [53]:
clean_titanic(fresh_df)

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,1,0,7.2500,Southampton,0
1,1,1,1,female,1,0,71.2833,Cherbourg,0
2,2,1,3,female,0,0,7.9250,Southampton,1
3,3,1,1,female,1,0,53.1000,Southampton,0
4,4,0,3,male,0,0,8.0500,Southampton,1
...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,Southampton,1
887,887,1,1,female,0,0,30.0000,Southampton,1
888,888,0,3,female,1,2,23.4500,Southampton,0
889,889,1,1,male,0,0,30.0000,Cherbourg,1
890,890,0,3,male,0,0,7.7500,Queenstown,1

In [54]:
titanic_df = clean_titanic(titanic_df)

In [55]:
train_titanic, validate_titanic, test_titanic = splitting_data(titanic_df, 'survived')

In [56]:
print(train_titanic.shape)
print(validate_titanic.shape)
print(test_titanic.shape)

(534, 9)
(178, 9)
(179, 9)

### 4. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [59]:
df_telco = acquire.get_telco_data()

In [60]:
df_telco = prep_telco(df_telco)

In [61]:
train_telco, validate_telco, test_telco = splitting_data(df_telco, 'churn')

In [62]:
print(train_telco.shape)
print(validate_telco.shape)
print(test_telco.shape)

(4225, 21)
(1409, 21)
(1409, 21)